cases/waam_arc/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       18160;
    }
    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       18560;
    }
    rightWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320;
        startFace       18960;
    }
    leftWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320;
        startFace       19280;
    }
    frontAndBack
    {
        type            patch;
        nFaces          640;
        startFace       19600;
    }
)

// ************************************************************************* //
