cases/waam_arc/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.phase1.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 3;
        cAlpha          1.0;
        scAlpha         0.5;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.0;
        smoother        GaussSeidel;
        nPreSweeps      2;
        nPostSweeps     3;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-9;
            relTol          0;
            nVcycles        5;
            smoother        GaussSeidel;
            nPreSweeps      2;
            nPostSweeps     3;
            nFinestSweeps   2;
            cacheAgglomeration on;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-9;
        relTol          0;
        maxIter         25;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-9;
            relTol          0;
            smoother        GaussSeidel;
        }
        tolerance       1e-9;
        relTol          0;
        maxIter         100;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0.0;
        nSweeps         5;
    }

    UFinal
    {
        $U;
        tolerance       1e-9;
        relTol          0;
    }

    Temperature
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0.0;
    }

    TemperatureFinal
    {
        $Temperature;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0.0;
    pRefValue       0.0;
}

MELTING
{
    minTempCorrector 1;
    maxTempCorrector 150;
    epsilonTolerance 1e-6;
    epsilonRelaxation 0.95;

    //  WAAM Arc Heat Source Parameters
    //  Goldak double-ellipsoid adapted for arc welding
    HS_a 0.002;           // Arc heat source radius [m]
    HS_bg 0.0;            // Beam gaussian offset [m]
    HS_velocity 0.0;      // Arc travel velocity [m/s] (set per case)
    HS_lg 0.0;            // Lead distance [m]
    HS_Q 780.0;           // Arc power [W] (set per case)

    HS_deposition_cutoff 0.5;

    Oscillation_Amplitude   0.0;
    Oscillation_Frequency   0.0;

    Y_R 0.2;              // Focusing parameter (Y_R->0 HS -> wider)
    focY    0.0165;       // Focal Y position [m]
    foc_shift_vel 0.0;    // Focal shift velocity [m/s]
    Q_ramp_rate 7800.0;   // Power ramp rate [W/s]
    tshift 0.25;          // Time shift for ramp [s]

    damperSwitch false;
}

relaxationFactors
{
    "U.*"           0.82;
}

// ************************************************************************* //
