cases/waam_arc/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 0
);

regions
(
    boxToCell
    {
        box (-0.05 -0.001 -0.05) (0.05 0.003 0.05);
        fieldValues
        (
            volScalarFieldValue alpha.phase1 1
        );
    }
);


// ************************************************************************* //
